package lab1.model;

/**
 * S - старт
 * OP - після операції +, -, *, /
 * OB - після звичайної відкриваючої дужки
 * FNOB - після відкриваючої дужки одразу за ім'ям функції
 * V_FN - читається ім'я
 * C - читається ціла частина числа
 * CD - прочитано десяткову крапку в числі
 * CDC - Читається дробова частина числа
 * CB - після закриваючої дужки
 * AS - після коми-роздільника аргументів функції
 * E - isAccepting() в кінці рядка
 */
public enum State {
    S, OP, OB, FNOB, V_FN, C, CD, CDC, CB, AS
}
